[
    {
        "id":"familiar_shadow",
        "name":"A familiar shadow",
        "showInLog":1,
        "stages":[
            {
                "progress":5,
                "logText":"In the devastated lands south of Stoutford, I found an ominous stone etched with strange symbols."
            },
            {
                "progress":10,
                "logText":"As I touched its glowing mark, an unnatural chill ran through me, and I heard a voice in my mind, calling out for help. It spoke of torment and told me to return to Crossglen to find answers."
            },
            {
                "progress":20,
                "logText":"The presence of the mark grows unbearable. I feel an overwhelming pull to return to Crossglen. There is something wrong, and I sense it's tied to my father. I must hurry to see what's happening."
            },
            {
                "progress":30,
                "logText":"I spoke to father. He assured me he's fine, but mentioned Leta hasn't been herself lately. She's been pacing her home and muttering to herself. I should check on her and see what's going on."
            },
            {
                "progress":40,
                "logText":"When I confronted Leta, she seemed different--angrier, more agitated. As I pressed her, a dark spirit suddenly manifested before me and attacked."
            },
            {
                "progress":50,
                "logText":"I defeated the Dark spirit, but it didn't feel like the end. The Dark spirit trapped inside Leta has fled back to the devastated lands south of Stoutford, where its power can grow stronger. I need to return there and finish what I started."
            },
            {
                "progress":60,
                "logText":"In the depths of the devastated lands south of Stoutford, I found the dark spirit waiting for me. It was stronger this time, but I defeated it once and for all. Whatever bond it had with me and Leta is broken. I should check-up on Leta again."
            },
            {
                "progress":70,
                "logText":"I returned to Crossglen to find everything changed. Leta has aged decades in an instant. Her child is now fully grown, and her timid husband, Oromir, seems like a different man entirely. They remember nothing of what happened. The spirit may be gone, but its curse has left a permanent mark on the lives it touched.",
                "rewardExperience":6548,
                "finishesQuest":1
            }
        ]
    },
    {
        "id":"mg2_exploded_star",
        "name":"The exploded star",
        "showInLog":1,
        "stages":[
            {
                "progress":5,
                "logText":"Teccow wouldn't talk to me at the moment. I should get stronger and come back later."
            },
            {
                "progress":10,
                "logText":"Teccow of Stoutford has seen ten tongues of light falling down to earth, or so he said."
            },
            {
                "progress":12,
                "logText":"Kealwea, the priest of Sullengard, has seen ten tongues of light falling down to earth, or so he said."
            },
            {
                "progress":15,
                "logText":"Teccow asked me to investigate and bring the fallen pieces."
            },
            {
                "progress":17,
                "logText":"Kealwea asked me to investigate and bring the fallen pieces."
            },
            {
                "progress":20,
                "logText":"I refused to do his work.",
                "finishesQuest":1
            },
            {
                "progress":21,
                "logText":"Teccow would be delighted, I should bring the pieces to him."
            },
            {
                "progress":22,
                "logText":"Kealwea would be delighted, I should bring the pieces to him."
            },
            {
                "progress":23,
                "logText":"Kealwea or Teccow would be delighted, I should bring the pieces to one of them."
            },
            {
                "progress":30,
                "logText":"I told Teccow that I have found all ten pieces. He required them so that he could destroy them."
            },
            {
                "progress":32,
                "logText":"I told Kealwea that I have found all ten pieces. He required them so that he could destroy them."
            },
            {
                "progress":40,
                "logText":"I changed my mind and would keep these glittery things. They're too pretty to be destroyed.",
                "rewardExperience":5000,
                "finishesQuest":1
            },
            {
                "progress":45,
                "logText":"I gave half of the pieces to Teccow who would destroy them.",
                "rewardExperience":10000
            },
            {
                "progress":46,
                "logText":"I gave the other half of the pieces to Teccow who would destroy them.",
                "rewardExperience":20000,
                "finishesQuest":1
            },
            {
                "progress":47,
                "logText":"I gave half of the pieces to Kealwea who would destroy them.",
                "rewardExperience":10000
            },
            {
                "progress":48,
                "logText":"I gave the other half of the pieces to Kealwea who would destroy them.",
                "rewardExperience":30000,
                "finishesQuest":1
            },
            {
                "progress":50,
                "logText":"I gave the pieces to Teccow who would destroy them.",
                "rewardExperience":20000,
                "finishesQuest":1
            },
            {
                "progress":52,
                "logText":"I gave the pieces to Kealwea who would destroy them.",
                "rewardExperience":20000,
                "finishesQuest":1
            },
            {
                "progress":60,
                "logText":"I gave the pieces to Pangitain who was very grateful. I felt like I was filled with warmth and wisdom.",
                "rewardExperience":40000
            },
            {
                "progress":62,
                "logText":"I gave the pieces to Pangitain who was very grateful.",
                "rewardExperience":2000,
                "finishesQuest":1
            },
            {
                "progress":101,
                "logText":"I have found a brightly shining piece of a crystal."
            },
            {
                "progress":102,
                "logText":"I have found a second brightly shining piece of a crystal."
            },
            {
                "progress":103,
                "logText":"I have found three brightly shining pieces of a crystal."
            },
            {
                "progress":104,
                "logText":"I have found four brightly shining pieces of a crystal."
            },
            {
                "progress":105,
                "logText":"I have found five brightly shining pieces of a crystal."
            },
            {
                "progress":106,
                "logText":"I have found six brightly shining pieces of a crystal."
            },
            {
                "progress":107,
                "logText":"I have found seven brightly shining pieces of a crystal."
            },
            {
                "progress":108,
                "logText":"I have found eight brightly shining pieces of a crystal."
            },
            {
                "progress":109,
                "logText":"I have found nine brightly shining pieces of a crystal."
            },
            {
                "progress":110,
                "logText":"Done at last - I have found the last piece of the crystal."
            }
        ]
    },
    {
        "id":"mg2_exploded_star_nd",
        "name":"mg2_exploded_star_nd",
        "showInLog":0,
        "stages":[
            {
                "progress":1,
                "logText":"1=Seek in galmore_66"
            },
            {
                "progress":2,
                "logText":"2=Seek in galmore_76"
            },
            {
                "progress":3,
                "logText":"3=Seek in galmore_73"
            },
            {
                "progress":4,
                "logText":"4=Seek in galmore_65"
            },
            {
                "progress":5,
                "logText":"5=Seek in galmore_56"
            },
            {
                "progress":6,
                "logText":"6=Seek in galmore_57a"
            },
            {
                "progress":7,
                "logText":"7=Seek in galmore_57b"
            },
            {
                "progress":8,
                "logText":"8=Seek in galmore_75"
            },
            {
                "progress":9,
                "logText":"9=Seek in galmore_74"
            },
            {
                "progress":10,
                "logText":"10=Seek in galmore_77"
            },
            {
                "progress":90,
                "logText":"90=No star drops"
            },
            {
                "progress":91,
                "logText":"91=End of quest"
            }
        ]
    },
    {
        "id":"galmore_nondisplayed",
        "name":"galmore_nondisplayed",
        "showInLog":0,
        "stages":[
            {
                "progress":1,
                "logText":"level 1 warning - marked stone"
            },
            {
                "progress":2,
                "logText":"level 2 warning - marked stone"
            },
            {
                "progress":3,
                "logText":"In Leta's basement, the PC met Leta's aged son."
            },
            {
                "progress":4,
                "logText":"A fight has been initiated between the PC and the Dark Spirit in the lava lands."
            },
            {
                "progress":5,
                "logText":"PC has discovered the graveyard south of the swamp and west of the Galmore settlement."
            },
            {
                "progress":8,
                "logText":"The PC has opened house two in the Galmore camp."
            },
            {
                "progress":9,
                "logText":"The PC has seen the tropics at the Galmore encampment."
            },
            {
                "progress":10,
                "logText":"The PC has talked to Myrelis about his creation."
            },
            {
                "progress":11,
                "logText":"Monsters after Andor"
            },
            {
                "progress":12,
                "logText":"Troll approached from the south"
            },
            {
                "progress":13,
                "logText":"PC killed the mother warg."
            },
            {
                "progress":14,
                "logText":"PC breaks vine and falls."
            },
            {
                "progress":15,
                "logText":"PC has talked to Eryndor - time for the ghost to move the next time the player goes outside."
            },
            {
                "progress":16,
                "logText":"Reuse galmore_rg_ghost_spawn - show dialogue"
            },
            {
                "progress":17,
                "logText":"PC brought the ring back to Eryndor"
            },
            {
                "progress":18,
                "logText":"PC has collected the pondslime extract."
            },
            {
                "progress":19,
                "logText":"PC has given the mysterious music box to Celdar."
            },
            {
                "progress":20,
                "logText":"Cavea no more dialogue"
            },
            {
                "progress":21,
                "logText":"Cavea visited"
            },
            {
                "progress":22,
                "logText":"Cavea renovated"
            },
            {
                "progress":23,
                "logText":"Feedback renovation"
            },
            {
                "progress":24,
                "logText":"PC breaks vine and falls. galmore_24"
            },
            {
                "progress":31,
                "logText":"mg2_cavea_carn"
            },
            {
                "progress":32,
                "logText":"mg2_cavea_feygard"
            },
            {
                "progress":33,
                "logText":"mg2_cavea_home"
            },
            {
                "progress":34,
                "logText":"mg2_cavea_..."
            },
            {
                "progress":35,
                "logText":"mg2_cavea_..."
            },
            {
                "progress":36,
                "logText":"mg2_cavea_norcity"
            },
            {
                "progress":37,
                "logText":"mg2_cavea_throdna"
            },
            {
                "progress":40,
                "logText":"galmore_58_house1_broken"
            },
            {
                "progress":41,
                "logText":"galmore_58_house1_pile1"
            },
            {
                "progress":42,
                "logText":"galmore_58_house1_pile2"
            },
            {
                "progress":43,
                "logText":"PC found the Blackwater Shield"
            },
            {
                "progress":44,
                "logText":"galmore_58_house1 stand south of chest"
            },
            {
                "progress":45,
                "logText":"galmore_58_house1 chest moved"
            },
            {
                "progress":50,
                "logText":"PC breaks vine and falls. galmore_33"
            },
            {
                "progress":51,
                "logText":"PC finds the unknown book on galmore_23."
            },
            {
                "progress":52,
                "logText":"rubycrest strider spawned on stoutford_filler_1"
            },
            {
                "progress":53,
                "logText":"rubycrest strider spawned on stoutford_filler_2"
            },
            {
                "progress":54,
                "logText":"rubycrest strider spawned on stoutford_filler_3 spawn 1"
            },
            {
                "progress":55,
                "logText":"rubycrest strider spawned on stoutford_filler_3 spawn 2"
            },
            {
                "progress":56,
                "logText":"rubycrest strider spawned on stoutford_filler_4"
            },
            {
                "progress":57,
                "logText":"Rubycrest Strider has been killed."
            },
            {
                "progress":58,
                "logText":"PC has Gem of Warmth, so the local artist let's PC stay."
            },
            {
                "progress":59,
                "logText":"PC got free leech from Vaelric."
            },
            {
                "progress":61,
                "logText":"PC has returned the looted gold found near the Sutdover River to Egrinda.",
                "rewardExperience":12000
            }
        ]
    },
    {
        "id":"swamp_healer",
        "name":"The swamp healer",
        "showInLog":1,
        "stages":[
            {
                "progress":10,
                "logText":"I encountered Vaelric, a reclusive healer living in the swamp between Mt. Galmore and Stoutford. He refused to help me unless I dealt with a dangerous creature corrupting his medicinal pools."
            },
            {
                "progress":20,
                "logText":"I defeated the monstrous creature that I found on Vaelric's land. This creature was enormous and venomous, feeding on the lifeblood of the swamp."
            },
            {
                "progress":30,
                "logText":"Vaelric rewarded me for my efforts by teaching me how to use leeches to heal bleeding wounds. He warned me to save them for dire situations and respect their power.",
                "rewardExperience":2449,
                "finishesQuest":1
            }
        ]
    },
    {
        "id":"mg_restless_grave",
        "name":"Restless in the grave",
        "showInLog":1,
        "stages":[
            {
                "progress":10,
                "logText":"I noticed that one of the Galmore grave plots looked to have been dug-up in the not-so-distant past. I should ask Vaelric about this."
            },
            {
                "progress":15,
                "logText":"I noticed that one of the Galmore grave plots looked to have been dug-up in the not-so-distant past."
            },
            {
                "progress":20,
                "logText":"After I mentioned to Vaelric that the graveyard near the Galmore encampment has a dug-up grave plot, he asked me to investigate it. I agreed to look for clues."
            },
            {
                "progress":30,
                "logText":"Just outside of the graveyard, I found a bell attached to a broken rope. It was partially buried and covered by grass, but I retrieved it."
            },
            {
                "progress":40,
                "logText":"I discovered a music box in the graveyard. It was partially buried and obscured by overgrown grass."
            },
            {
                "progress":45,
                "logText":"I discovered the skeletal remains of a human beneath a covering of grass and weeds. I wonder if it's related to why that grave plot is dug up?"
            },
            {
                "progress":50,
                "logText":"I brought the bell and music box to the Galmore encampment and encountered a ghost named Eryndor that told me the items were his. I gave them to him in exchange for being \"friends\"."
            },
            {
                "progress":60,
                "logText":"Eryndor told me his story and said he would leave Vaelric alone if I returned his ring. I should return to Vaelric."
            },
            {
                "progress":63,
                "logText":"Vaelric has told me his side of the story. He claimed that Eryndor came to him desperate, in a severe condition and Vaeltic said he did everything he could to save Eryndor's life. Thinking that Eryndor was dead, Vaelric buried him."
            },
            {
                "progress":65,
                "logText":"After hearing Eryndor's story, I decided that he has been wronged. I also agreed to get his ring back from Vaelric."
            },
            {
                "progress":70,
                "logText":"I informed Vaelric of the ghost's terms, and he agreed. He also gave me Eryndor's ring and now I should return it to Eryndor."
            },
            {
                "progress":77,
                "logText":"I've stolen the ring from Vaelric's attic."
            },
            {
                "progress":80,
                "logText":"I lied to Vaelric as I informed him that I was not able to find any clues surrounding the grave site or anywhere else."
            },
            {
                "progress":85,
                "logText":"I brought the ring back to Eryndor. Vaelric received no relief from the haunting."
            },
            {
                "progress":90,
                "logText":"I brought the ring back to Eryndor and he agreed to stop haunting Vaelric."
            },
            {
                "progress":95,
                "logText":"Vaelric rewarded me by offering to make Insectbane Tonics if I bring him the right ingredients."
            },
            {
                "progress":97,
                "logText":"I need to bring Vaelric the following ingredients in order for him to make his \"Insectbane Tonic\": five Duskbloom flowers, five Mosquito proboscises, ten bottles of swamp water and one sample of Mudfiend goo."
            },
            {
                "progress":100,
                "logText":"I brought the ring back to Eryndor just to tell him that I've decided to keep it."
            },
            {
                "progress":110,
                "logText":"When I refused to return the ring, Eryndor attacked me."
            },
            {
                "progress":111,
                "logText":"I defeated Eryndor and prevented the hauntings of Vaelric...for now, but I feel that they will resume someday."
            },
            {
                "progress":115,
                "logText":"Vaelric is now able to mix up some Insectbane tonic for me.",
                "rewardExperience":6000,
                "finishesQuest":1
            },
            {
                "progress":120,
                "logText":"I've informed Vaelric that I defeated Eryndor but was not able to promise an end to the hauntings, Vaelric was dissatisfied with me and the outcome even going as far as saying that Andor is a better person than I am.",
                "rewardExperience":100,
                "finishesQuest":1
            },
            {
                "progress":123,
                "logText":"Eryndor has asked me to find Celdar, a woman from Sullengard and give her the mysterious music box because he has no need for it and it's the right thing to do. I think I remember hearing that name, \"Celdar\" somewhere. Eryndor stated that Celdar is intolerant of fools and petty trades and wears a garish purple dress."
            },
            {
                "progress":125,
                "logText":"In Sullengard, Maddalena informed me that Celdar was headed for Brimhaven, but may have stopped to rest along the way as it is a long trip to Brimhaven."
            },
            {
                "progress":130,
                "logText":"I gave Celdar the 'Mysterious music box' just as Eryndor had instructed and she gave me her longsword.",
                "rewardExperience":4500,
                "finishesQuest":1
            }
        ]
    }
]