[
    {
        "id":"darkness_in_daylight",
        "name":"Darkness in the Daylight",
        "showInLog":1,
        "stages":[
            {
                "progress":10,
                "logText":"I met Miri in the Crossroads Guardhouse."
            },
            {
                "progress":20,
                "logText":"Since I had helped Ailshara, she wouldn't tell me about Andor.",
                "rewardExperience":1,
                "finishesQuest":1
            },
            {
                "progress":30,
                "logText":"Since I had hidden the truth about the bootlegging of beer from Sullengard, she wouldn't tell me about Andor.",
                "rewardExperience":1,
                "finishesQuest":1
            },
            {
                "progress":40,
                "logText":"Since I had aided Feygard once or twice earlier, she would tell me about Andor, after I had completed an investigation for her."
            },
            {
                "progress":50,
                "logText":"Since Miri was poisoned by slitherers near Sullengard, and healing is taking time, she wanted me to investigate something bad in the Purple Hills in the strange areas to the south of Stoutford."
            },
            {
                "progress":60,
                "logText":"I went to the area to the south of Stoutford and encountered an impassable force there."
            },
            {
                "progress":70,
                "logText":"There was a piece of Kazaul ritual there, which I had encountered before. I had to inform Miri."
            },
            {
                "progress":80,
                "logText":"Miri asked me where I had seen this before. I told her about a task I had carried out on behalf of Throdna."
            },
            {
                "progress":90,
                "logText":"Miri told me to meet him and enquire further. And gave me a phrase to use whenever he started rambling."
            },
            {
                "progress":100,
                "logText":"Throdna told me it was part of a ritual to break the barrier which forms when one does a ritual to call strong Kazaul monsters."
            },
            {
                "progress":110,
                "logText":"The ritual consisted of two parts which I had found earlier, and a chant in a book called Calomyran Secrets. I needed to report this to Miri."
            },
            {
                "progress":120,
                "logText":"I told Miri about finding the book for an Old Man in Fallhaven.  She told me to talk to him."
            },
            {
                "progress":130,
                "logText":"The Old Man would not let me borrow the book, so I started noting the chant in front of him."
            },
            {
                "progress":140,
                "logText":"The book contained half the chant. The rest was to be found in another book Azimyran Secrets."
            },
            {
                "progress":150,
                "logText":"Miri told me she'd trace the book. She told me to wait for her return."
            },
            {
                "progress":160,
                "logText":"Miri came back and told me that the book Azimyran Secrets was with an old hermit near Arulir mountain."
            },
            {
                "progress":170,
                "logText":"I met the old hermit and asked him about the book, Azimyran Secrets."
            },
            {
                "progress":180,
                "logText":"He refused to give it to me, so I copied the chant sitting with him. I needed to tell Miri."
            },
            {
                "progress":190,
                "logText":"Miri told me to hurry, and pass the barrier."
            },
            {
                "progress":198,
                "logText":"After destroying the ritual statue of Kazaul, beyond the barrier I found a crying woman.",
                "rewardExperience":5000
            },
            {
                "progress":200,
                "logText":"She was performing a ritual that should bring her husband back to life."
            },
            {
                "progress":210,
                "logText":"Miri, who followed me, convinced the woman that it was actually an evil ritual to overrun Dhayavar with Kazaul's monsters."
            },
            {
                "progress":220,
                "logText":"The mourning woman told us that the ritual was given to her by a priest who walks on lava east of the Purple Hills."
            },
            {
                "progress":230,
                "logText":"We let the mourning woman go."
            },
            {
                "progress":232,
                "logText":"The mourning woman cried that she would never be happy again.",
                "rewardExperience":2000
            },
            {
                "progress":240,
                "logText":"I had to travel to the lava wastelands."
            },
            {
                "progress":250,
                "logText":"There, after fighting monsters, I met a priest in red."
            },
            {
                "progress":260,
                "logText":"He accused me of interfering. Miri, who again followed me, revealed the red priest to be a monster."
            },
            {
                "progress":270,
                "logText":"I defeated the monster."
            },
            {
                "progress":280,
                "logText":"Miri fulfilled her promise and told me that Andor would be refilling his food supplies at Rosmara's food stand.",
                "rewardExperience":15000
            },
            {
                "progress":300,
                "logText":"Indeed, I have found Andor there."
            },
            {
                "progress":310,
                "logText":"He told me he couldn't come home now, and vanished.",
                "rewardExperience":5000,
                "finishesQuest":1
            }
        ]
    },
    {
        "id":"shadows",
        "name":"Shadows",
        "showInLog":1,
        "stages":[
            {
                "progress":10,
                "logText":"I met Borvis on the great road near Alynndir's hut."
            },
            {
                "progress":20,
                "logText":"Since I had told Gandoren about the switch of the weapons, and also the truth about the bootlegging of beer from Sullengard, he told me to leave.",
                "rewardExperience":1,
                "finishesQuest":1
            },
            {
                "progress":30,
                "logText":"Since I aided the Shadow once or twice earlier, he requested my further help for an urgent task."
            },
            {
                "progress":40,
                "logText":"He wanted me to investigate something bad in the Purple Hills in the weird areas to the south of Stoutford."
            },
            {
                "progress":50,
                "logText":"I went to the area to the south of Stoutford, and encountered an impassable force there."
            },
            {
                "progress":60,
                "logText":"There were strange glowing, immovable pebbles there. I had to inform Borvis."
            },
            {
                "progress":70,
                "logText":"Borvis told me that was the basic, but effective, Shadow shield, to protect Shadow incantations from outside interference. "
            },
            {
                "progress":80,
                "logText":"For that, he would give me a chant. But I had to get him energies in the form of four 'blessings' - Shadow's Strength, Shadow Awareness, Fatigue, and Life Drain - within myself. He told me to go to Talion in Loneford for the first blessing, and for information about the others."
            },
            {
                "progress":90,
                "logText":"Talion bestowed me with Shadow's Strength."
            },
            {
                "progress":100,
                "logText":"Talion told me to seek out Jolnor in Vilegard for the rest of the 'blessings'."
            },
            {
                "progress":110,
                "logText":"Jolnor bestowed me with Shadow Awareness."
            },
            {
                "progress":120,
                "logText":"Jolnor told me to seek Favlon to the west of Sullengard for the remaining two."
            },
            {
                "progress":130,
                "logText":"I reached Favlon who asked me for 10 Cooked Meat."
            },
            {
                "progress":140,
                "logText":"I gave Favlon 10 Cooked Meat. He bestowed me with 'blessings' of Fatigue and Life Drain."
            },
            {
                "progress":150,
                "logText":"After a grueling travel back, I returned to Borvis."
            },
            {
                "progress":160,
                "logText":"Borvis removed the 'blessings' from me, and made a chant."
            },
            {
                "progress":165,
                "logText":"Borvis told me to hurry back to the barrier."
            },
            {
                "progress":170,
                "logText":"I passed the barrier."
            },
            {
                "progress":178,
                "logText":"After destroying the ritual statue of Kazaul, beyond the barrier I found a crying woman.",
                "rewardExperience":5000
            },
            {
                "progress":180,
                "logText":"She was performing a ritual that should bring her husband back to life."
            },
            {
                "progress":190,
                "logText":"Borvis, who followed me, convinced the woman that it was actually an evil ritual to overrun Dhayar with Kazaul's monsters."
            },
            {
                "progress":200,
                "logText":"The mourning woman told us that the ritual was given to her by a priest in the lava wastelands."
            },
            {
                "progress":210,
                "logText":"We let the mourning woman go."
            },
            {
                "progress":212,
                "logText":"The mourning woman cried that she would never be happy again.",
                "rewardExperience":2000
            },
            {
                "progress":220,
                "logText":"I had to travel to the lava wastelands."
            },
            {
                "progress":230,
                "logText":"There, after fighting monsters, I met a priest in red."
            },
            {
                "progress":240,
                "logText":"He accused me of interfering again and again. Borvis, who again followed me, revealed the red priest to be a monster."
            },
            {
                "progress":250,
                "logText":"I defeated the monster."
            },
            {
                "progress":260,
                "logText":"Borvis fulfilled his promise and told me that Andor would be refilling his supplies from Alynndir.",
                "rewardExperience":15000
            },
            {
                "progress":270,
                "logText":"I ran to Alynndir's hut. "
            },
            {
                "progress":280,
                "logText":"I found Andor there."
            },
            {
                "progress":290,
                "logText":"He told me he couldn't come home now, and vanished.",
                "rewardExperience":5000,
                "finishesQuest":1
            }
        ]
    },
    {
        "id":"dds_nd",
        "name":"Darkness in the Daylight and Shadows - Non displayed",
        "showInLog":0,
        "stages":[
            {
                "progress":1,
                "logText":"1=Miri spawned at Crossroads"
            },
            {
                "progress":2,
                "logText":"2=Miri spawned 2"
            },
            {
                "progress":3,
                "logText":"3=Dark shield active"
            },
            {
                "progress":4,
                "logText":"4=Miri spawned 3"
            },
            {
                "progress":5,
                "logText":"5=Dark priest killed"
            },
            {
                "progress":6,
                "logText":"6=Andor spawned at Rosmara/Alynndir"
            },
            {
                "progress":11,
                "logText":"11=Borvis spawned near Alynndir's hut"
            },
            {
                "progress":20,
                "logText":"20=Told Mikhail about meeting Andor in Miri's or Borvis' quest"
            }
        ]
    }
]