[
    {
        "id":"troubling_times",
        "name":"Troubling times",
        "showInLog":1,
        "stages":[
            {
                "progress":10,
                "logText":"I went to the Thieves' Guild in Fallhaven looking for things to do."
            },
            {
                "progress":20,
                "logText":"Since I had helped Defy, Umar and Nanath threw me out. I cannot enter the basement again.",
                "rewardExperience":1,
                "finishesQuest":1
            },
            {
                "progress":30,
                "logText":"Since I had looted the Thieves' Guild vault after killing Defy, Umar and Nanath threw me out. I cannot enter the basement again.",
                "rewardExperience":1,
                "finishesQuest":1
            },
            {
                "progress":40,
                "logText":"I met Nanath, who's scared and upset, because someone put a spell on all members of the Thieves' Guild. This spell made all thieves noticeable. He asked me if I could help dispel the spell."
            },
            {
                "progress":50,
                "logText":"Nanath told me to find the Shadow priest who had cast the spell on the Guild."
            },
            {
                "progress":60,
                "logText":"I set out interviewing Shadow priests to find who had cast the spell."
            },
            {
                "progress":70,
                "logText":"Talion, Shadow priest of Loneford, had cast the Striking Spectacle Shadow spell on the Guild, on payment from Dameni, a mysterious lady leading a band of toughs"
            },
            {
                "progress":80,
                "logText":"Talion could dispel the spell, using a few items - Villain's ring, Troublemaker's ring, ring of backstabbing, Tears of the Shadow potion, Luthor's ring.  He also wanted 50000 gold."
            },
            {
                "progress":82,
                "logText":"I have informed Nanath about the Striking Spectacle Shadow spell and Talion's demands."
            },
            {
                "progress":90,
                "logText":"Nanath told me Thieves' Guild would give me the 50000 gold back when I have got the spell dispelled."
            },
            {
                "progress":95,
                "logText":"Nanath asked if I had already found Luthor's ring."
            },
            {
                "progress":100,
                "logText":"I went back to Nanath as I couldn't find Luthor's ring anywhere."
            },
            {
                "progress":105,
                "logText":"He told me to seek out Fanamor's friend Sly Seraphina near the Sutdover bridge."
            },
            {
                "progress":110,
                "logText":"Seraphina didn't believe me. She told me to go away."
            },
            {
                "progress":115,
                "logText":"Nanath sent me to Umar. He should make sure Sly carries out the order."
            },
            {
                "progress":120,
                "logText":"Umar told me one of his secret passwords to convince Seraphina."
            },
            {
                "progress":130,
                "logText":"Sly Seraphina said that Luthor's ring was to be found in the cave which Crackshot tried to open. The door was sealed by Umar and Seraphina to prevent monsters in that cave from devastating Dhayavar. The sealing was done by using Luthor's items. She and Umar decided to separate them, and keep them separate."
            },
            {
                "progress":140,
                "logText":"Seraphina felt that the danger was too high to open that door. So she disappeared."
            },
            {
                "progress":150,
                "logText":"I had to find Sly Seraphina again."
            },
            {
                "progress":160,
                "logText":"Nanath told me to look for her in her usual hiding places: Near one of the towns Sullengard, Stoutford, Vilegard, Prim, Loneford, or Brimhaven."
            },
            {
                "progress":170,
                "logText":"Talion said that without the items he asked for he couldn't help. I had to find Seraphina."
            },
            {
                "progress":180,
                "logText":"After beating the tough guys protecting Seraphina, she was convinced that I was strong enough to help her beat the monsters in the cave."
            },
            {
                "progress":190,
                "logText":"Seraphina gave me back the money she had stolen from me earlier."
            },
            {
                "progress":192,
                "logText":"I have to ask Umar for Luthor's key."
            },
            {
                "progress":193,
                "logText":"I have got the key."
            },
            {
                "progress":195,
                "logText":"Seraphina agreed to help me and told me to meet her at the locked door in the cave where Crackshot was defeated."
            },
            {
                "progress":200,
                "logText":"I met Seraphina at the cave door where Crackshot was defeated."
            },
            {
                "progress":210,
                "logText":"Seraphina could open the door with Luthor's key wearing also his gloves. She entered the cave behind the door."
            },
            {
                "progress":220,
                "logText":"I followed her."
            },
            {
                "progress":230,
                "logText":"Seraphina got injured attacking one of the monsters."
            },
            {
                "progress":240,
                "logText":"I have killed the monsters blocking the entrance."
            },
            {
                "progress":250,
                "logText":"I healed Seraphina using potions."
            },
            {
                "progress":252,
                "logText":"I tried to poison Seraphina, but she noticed in time. At least she didn't notice that I did it on purpose."
            },
            {
                "progress":255,
                "logText":"Seraphina already started the search for the ring."
            },
            {
                "progress":260,
                "logText":"I searched the cave for Luthor's ring. I couldn't find it."
            },
            {
                "progress":270,
                "logText":"Sly Seraphina had found the ring. She gave it to me and told me to keep it safe. She disappeared again, probably back to Sutdover bridge. I had to go to Talion."
            },
            {
                "progress":280,
                "logText":"I gave 50000 gold, Villain's ring, Troublemaker's ring, ring of backstabbing, Tears of the Shadow potion, and Luthor's ring to Talion."
            },
            {
                "progress":290,
                "logText":"Talion used them to undo the spell."
            },
            {
                "progress":300,
                "logText":"Talion returned Luthor's ring. The other rings were broken in the process though and the Tears of the Shadow potion was used up of course."
            },
            {
                "progress":302,
                "logText":"The room with the dangerous creatures has been locked and sealed again."
            },
            {
                "progress":310,
                "logText":"Nanath gave me 75000 gold as a reward for a job well done.",
                "rewardExperience":15000,
                "finishesQuest":1
            },
            {
                "progress":320,
                "logText":"Sly Seraphina was friendly to me - for now."
            }
        ]
    },
    {
        "id":"troubling_times_nd",
        "name":"troubling_times_nd",
        "showInLog":0,
        "stages":[
            {
                "progress":10,
                "logText":"Seraphina search"
            },
            {
                "progress":20,
                "logText":"Crackshot's door unsealed"
            },
            {
                "progress":30,
                "logText":"1=standing north of Sly while she blocks the passage"
            }
        ]
    }
]